#!/usr/bin/env python3
# -*- coding: utf-8 -*-
import numpy as np

np1 = np.array([1, 2, 3])
print(np1) # [1 2 3]

np2 = np.array([[2,3,4],[3,4,5]])
print(np2)
"""
[[2 3 4]
 [3 4 5]]
"""

print(np1 + np2)
"""
[[3 5 7]
 [4 6 8]]
"""

print(np2.shape[0]) # 2
print(np2.shape[1]) # 3

# 全為0
np3 = np.zeros([2, 3])
print(np3)
"""
[[0. 0. 0.]
 [0. 0. 0.]]
"""

# 全為1
np4 = np.ones([2, 3]) 
print(np4)
"""
[[1. 1. 1.]
 [1. 1. 1.]]
"""

# 接近0
np5 = np.empty((3,4))
print(np5)
"""
[[1.54136387e-316 6.90035230e-310 0.00000000e+000 0.00000000e+000]
 [0.00000000e+000 0.00000000e+000 0.00000000e+000 0.00000000e+000]
 [0.00000000e+000 0.00000000e+000 0.00000000e+000 0.00000000e+000]]
"""

np6 = np.array([1,2,3,4,5,6])
np7 = np6.reshape(2,3)
print(np6) # [1 2 3 4 5 6]
print(np7)
"""
[[1 2 3]
 [4 5 6]]
"""

# 共用同一組數據，修改一個數據的元素，另一個數據也會改變
np6[2] = 10
print(np7)
"""
[[ 1  2 10]
 [ 4  5  6]]
"""

# 取出第二row, 取出的數據是共用同一組數據，修改一個數據的元素，另一個數據也會改變
np8 = np7[1, :]
print(np8) # [4 5 6]
# 取出第二column, 取出的數據是共用同一組數據，修改一個數據的元素，另一個數據也會改變
np9 = np7[:, 1]
print(np9) # [2 5]
